## 7.1 누락된 데이터 처리하기

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
cleaned = data.dropna()

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA

In [15]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))

In [18]:
df

          0         1         2
0  0.160831  0.622873 -1.609708
1 -1.375422  1.135748  1.665184
2 -0.414989 -0.808971  0.266146
3 -0.073859  0.147696 -2.102534
4  1.485686 -0.597598 -0.246004
5 -1.892211  0.860684 -1.023426
6 -0.253727  0.277749  1.074809

In [19]:
df.iloc[:4, 1] = NA

In [20]:
df.iloc[:2, 2] = NA

In [21]:
df

          0         1         2
0  0.160831       NaN       NaN
1 -1.375422       NaN       NaN
2 -0.414989       NaN  0.266146
3 -0.073859       NaN -2.102534
4  1.485686 -0.597598 -0.246004
5 -1.892211  0.860684 -1.023426
6 -0.253727  0.277749  1.074809

In [22]:
df.dropna()

          0         1         2
4  1.485686 -0.597598 -0.246004
5 -1.892211  0.860684 -1.023426
6 -0.253727  0.277749  1.074809

In [23]:
df.dropna(thresh=2)

          0         1         2
2 -0.414989       NaN  0.266146
3 -0.073859       NaN -2.102534
4  1.485686 -0.597598 -0.246004
5 -1.892211  0.860684 -1.023426
6 -0.253727  0.277749  1.074809

### 7.1.2 결측치 채우기

In [24]:
df.fillna(0)

          0         1         2
0  0.160831  0.000000  0.000000
1 -1.375422  0.000000  0.000000
2 -0.414989  0.000000  0.266146
3 -0.073859  0.000000 -2.102534
4  1.485686 -0.597598 -0.246004
5 -1.892211  0.860684 -1.023426
6 -0.253727  0.277749  1.074809

In [25]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.160831  0.500000  0.000000
1 -1.375422  0.500000  0.000000
2 -0.414989  0.500000  0.266146
3 -0.073859  0.500000 -2.102534
4  1.485686 -0.597598 -0.246004
5 -1.892211  0.860684 -1.023426
6 -0.253727  0.277749  1.074809

In [26]:
df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0  0.160831  0.000000  0.000000
1 -1.375422  0.000000  0.000000
2 -0.414989  0.000000  0.266146
3 -0.073859  0.000000 -2.102534
4  1.485686 -0.597598 -0.246004
5 -1.892211  0.860684 -1.023426
6 -0.253727  0.277749  1.074809

In [28]:
df = pd.DataFrame(np.random.randn(6,3))

In [29]:
df.iloc[2:, 1] = NA

In [30]:
df.iloc[4:, 2] = NA

In [31]:
df

          0         1         2
0  0.973867 -0.110722  1.124833
1 -0.285181 -1.305843 -0.502928
2  1.278899       NaN  0.381900
3  0.583766       NaN -0.738548
4  1.127348       NaN       NaN
5 -0.348019       NaN       NaN

In [32]:
df.fillna(method='ffill')

          0         1         2
0  0.973867 -0.110722  1.124833
1 -0.285181 -1.305843 -0.502928
2  1.278899 -1.305843  0.381900
3  0.583766 -1.305843 -0.738548
4  1.127348 -1.305843 -0.738548
5 -0.348019 -1.305843 -0.738548

In [33]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [34]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 데이터 변형

### 7.2.1 중복 제거하기

In [35]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [36]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [38]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1'] = range(7)

In [41]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 7.2.2 함수나 매핑을 이용해서 데이터 변형하기

In [43]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beff', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [44]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beff     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beff': 'pig',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()

In [47]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beff
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [48]:
data['animal'] = lowercased.map(meat_to_animal)

In [49]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beff     7.5     pig
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [50]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       pig
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beff     7.5     pig
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### 7.2.3 값 치환하기

In [52]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [53]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [56]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data = pd.DataFrame(np.arange(12).reshape((3,4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [67]:
transform = lambda x: x[:4].upper()

In [68]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [69]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [70]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three':'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [71]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [72]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

### 7.2.5 개별화와 양자화

In [73]:
ages = [20, 22, 25, 27, 21, 23, 37, 61, 45, 41, 32]

In [74]:
bins = [18, 25, 35, 60, 100]

In [75]:
cats = pd.cut(ages, bins)

In [76]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [77]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 3, 2, 2, 1], dtype=int8)

In [78]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [79]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [80]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [36, 61), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 11
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [81]:
group_name = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [83]:
pd.cut(ages, bins, labels=group_name)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'MiddleAged', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 11
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [84]:
data = np.random.randn(20)

In [85]:
pd.cut(data, 4, precision=2)

[(-0.9, 0.028], (-1.84, -0.9], (0.028, 0.96], (0.96, 1.89], (-1.84, -0.9], ..., (-0.9, 0.028], (-0.9, 0.028], (-0.9, 0.028], (-1.84, -0.9], (-0.9, 0.028]]
Length: 20
Categories (4, interval[float64]): [(-1.84, -0.9] < (-0.9, 0.028] < (0.028, 0.96] < (0.96, 1.89]]

In [87]:
data = np.random.randn(1000)

In [88]:
cats = pd.qcut(data, 4)

In [89]:
cats

[(-0.015, 0.71], (-0.015, 0.71], (-2.7689999999999997, -0.656], (0.71, 3.074], (-0.656, -0.015], ..., (-0.015, 0.71], (0.71, 3.074], (0.71, 3.074], (-0.656, -0.015], (0.71, 3.074]]
Length: 1000
Categories (4, interval[float64]): [(-2.7689999999999997, -0.656] < (-0.656, -0.015] < (-0.015, 0.71] < (0.71, 3.074]]

In [90]:
pd.value_counts(cats)

(-2.7689999999999997, -0.656]    250
(-0.656, -0.015]                 250
(-0.015, 0.71]                   250
(0.71, 3.074]                    250
dtype: int64

In [91]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.015, 1.303], (-0.015, 1.303], (-2.7689999999999997, -1.386], (1.303, 3.074], (-1.386, -0.015], ..., (-0.015, 1.303], (1.303, 3.074], (-0.015, 1.303], (-1.386, -0.015], (1.303, 3.074]]
Length: 1000
Categories (4, interval[float64]): [(-2.7689999999999997, -1.386] < (-1.386, -0.015] < (-0.015, 1.303] < (1.303, 3.074]]

### 7.2.6 특잇값을 찾고 제와하기

In [93]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [94]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002274     0.058683     0.015227     0.003812
std       0.979311     0.990743     1.035853     0.971292
min      -2.969185    -4.551707    -3.398667    -3.068099
25%      -0.618054    -0.620245    -0.639721    -0.633514
50%      -0.033136     0.041788     0.039702    -0.006467
75%       0.666826     0.745464     0.724974     0.666848
max       3.341432     3.406378     3.227467     3.415484

In [95]:
col = data[2]

In [96]:
col[np.abs(col)>3]

101    3.083415
180   -3.398667
847    3.227467
917   -3.334646
Name: 2, dtype: float64

In [97]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
101 -0.121707  1.615835  3.083415  0.418616
141 -0.192276 -1.900528  0.506649  3.166695
180 -0.010711 -1.413320 -3.398667  0.917100
282 -0.348786  0.317873 -0.225221  3.415484
297  3.341432  2.564656 -0.162882 -1.319616
342  0.388446  3.406378  0.859015 -0.318927
385  1.632909  1.012533  0.198001 -3.068099
820  3.319495  1.481870 -0.205085  0.735588
834  0.640153 -3.281038  0.660422  0.919448
847  0.413105 -0.127790  3.227467  0.174834
917 -1.664615  0.952696 -3.334646 -0.244835
960  0.262042 -4.551707 -0.079523  0.738679
968  0.015532 -1.677084 -0.418376  3.271997

In [98]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [99]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002935     0.060110     0.015650     0.003026
std       0.977169     0.982497     1.032655     0.968295
min      -2.969185    -3.000000    -3.000000    -3.000000
25%      -0.618054    -0.620245    -0.639721    -0.633514
50%      -0.033136     0.041788     0.039702    -0.006467
75%       0.666826     0.745464     0.724974     0.666848
max       3.000000     3.000000     3.000000     3.000000

In [100]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1 -1.0  1.0 -1.0 -1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0 -1.0
4  1.0 -1.0  1.0  1.0

### 7.2.7 치환과 임의 샘플링

In [101]:
df = pd.DataFrame(np.arange(5*4).reshape(5,4))

In [102]:
sampler = np.random.permutation(5)

In [103]:
sampler

array([3, 4, 2, 1, 0])

In [104]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [105]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [106]:
df.sample(3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [107]:
choices = pd.Series([5, 7, -1, 6, 4])

In [108]:
draws = choices.sample(n=10, replace=True)

In [109]:
draws

0    5
0    5
4    4
4    4
2   -1
4    4
4    4
2   -1
1    7
3    6
dtype: int64

### 7.2.8 표시자/더미 변수 계산하기

In [110]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1':range(6)})

In [113]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [112]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [114]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [116]:
df_with_dummy = df[['data1']].join(dummies)

In [117]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [118]:
mnames = ['movie_id', 'title', 'geners']

In [120]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

<ipython-input-120-b5fb323bf003>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

In [121]:
movies[:10]

   movie_id                               title                        geners
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [122]:
all_genres = []

In [123]:
for x in movies.geners:
    all_genres.extend(x.split('|'))

In [124]:
genres = pd.unique(all_genres)

In [125]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [126]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [127]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [128]:
gen = movies.geners[0]

In [129]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [130]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [131]:
for i, gen in enumerate(movies.geners):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [132]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [133]:
movies_windic[:10]

,movie_id,title,geners,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,6,Heat (1995),Action|Crime|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,7,Sabrina (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
7,8,Tom and Huck (1995),Adventure|Children's,0.0,1.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,9,Sudden Death (1995),Action,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,10,GoldenEye (1995),Action|Adventure|Thriller,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [134]:
np.random.seed(12345)

In [135]:
values = np.random.rand(10)

In [136]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [137]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [138]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 문자열 다루기

### 7.3.1 문자열 객체 메서드

In [139]:
val = 'a,b, guido'

In [140]:
val.split(',')

['a', 'b', ' guido']

In [141]:
pieces = [x.strip() for x in val.split(',')]

In [142]:
pieces

['a', 'b', 'guido']

In [143]:
val = [[1,2,3],[4,5,6],[7,8,9]]

In [146]:
flat = [e for x in val for e in x]

In [147]:
flat

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [148]:
first, second, third = pieces

In [150]:
first + '::' + second + '::' + third

'a::b::guido'

### 7.3.2 정규 표현식

In [152]:
import re

In [153]:
text = "foo bar\t baz \tqux"

In [154]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [155]:
regex = re.compile('\s+')

In [156]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [157]:
regex.findall(text)

[' ', '\t ', ' \t']

### 7.3.3 pandas의 벡터화된 문자열 함수

In [158]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob':'rob@gamil.com', 'Wes': np.nan}

In [159]:
data = pd.Series(data)

In [160]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gamil.com
Wes                  NaN
dtype: object

In [161]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [162]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob      False
Wes        NaN
dtype: object

In [168]:
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [169]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gamil, com)]
Wes                        NaN
dtype: object